import os

n = 100
f = open("D://New folder/pythonCons/.txtFiles/testFile.txt", "r")#відкрити файл
    #Параметри замість r також можуть бути іншими
    # r - читання якщо файл не існує буде помилка
    # a - редагування файлу створить файл якщо його не існує
    # w - запис файлу, створить файл якщо його не існує перезаписує файл
    # x - створення файлу
    #
    # t - текстовий режим
    # b - бінарний режим
print(f.read(n)) #виведе n символів з файлу
print(f.readline()) # виведе першу лінію з файлу, якщо вивести два рази в ряд, виведе не 2 рази перший рядок, а 1 і 2
f.close() #закрити файл



with open("D://New folder/pythonCons/.txtFiles/testFile.txt") as d: #те саме, просто не треба перейматись про закриття файлу
    for x in len(d):
        print(x)                                                    #Також можна вивести весь файл просто як масив, індекси ідуть по рядкам


with open("D://New folder/pythonCons/.txtFiles/testFile.txt", "a") as g: # додавання контенту до файлу
    g.write("Update hehe")

os.path.exists() # Перевіряє чи існує такий файл
os.remove() #Видаляє файл
os.rmdir() #Видалити папку (тільки порожню)