a = 5 # присвоєння змінної
b = 0
c = input() #ввід данних з терміналу початково змінна буде string
d = int(input()) #ми отримали данні і вони уже int

#ifelse
if a < 6:
    print("da")
else:
    print("no")

#while for
while a == 5:
    b += 1
    if b == 4:
        break

for i in range(10): #можна прописати назву масиву замість range буде те саме як range(len(nums))
    print(i)
    i = 5

#arrays
nums = [1, 2, 5, [1, 6, 3]]
nums2 = [3, 5, 3, 0, 12]
print(nums[1][-1])

nums.append(30) #вставити число 30 в кінець списку nums
nums.insert(1, True) #вставити True в масив nums по індексу 1
nums.extend(nums2) #вставити масив nums2 в кінець масиву nums
nums2.sort() #сортування масиву nums по зростанню
nums2.reverse() #перезаписати масив nums2 з кінця до початку
nums2.pop() #видалити останній елемент в списку
nums2.remove(0) #видалити елемент з масиву(записуєм не індекс, а певне число)
nums.clear() #очистити масив
nums2.count(3) #порахувати кількість 3 в масиві
len(nums2) #вивести довжину масиву

#working with text
array = 'hello'
array = list(array) # перетворення тексту в список
newArray = ' ,'.join(array) # при виведенні буде кожен символ виводитись через пробіл з комою
#.lower(array) .upper(array) Прописати все маленькими і великими літерами
#.capitalize(array) Перша буква кожного слова буде з великої літери
#.islower .isupper Перевіряє чи всі символи в нижньому(верхньому) регістрі
print(array[0:3:2]) #виведення від першого до 3 елементу з масиву (перше число це індекс, друге це номер) з кроком 2
print(array[::3]) #виведення елементів масиву з кроком 3 (при від'ємному значенні виводиметься масив з кінця, з певним кроком ІНШІ ПАРАМЕТРИ ТЕЖ ВІД'ЄМНІ)

text = 'first,second,third'
hobbies = text.split(',') # зробить з text масив який буде розділятись по комі 

#Кортежи

#Кортеж це така ж змінна чи масив як і інші, але ми не можемо змінювати значення всередині, тобто це константа
data = (5, 3, 1, 4)
#або такий варіант запису(працює тільки з списками, в іншому випадку, це буде просто змінна)
data1 = 5, 3, 1, 4
array2 = [3, 5, 1, 4, "base"]
array2 = tuple(array2) #перетворення масиву в кортеж


#Словники
#          ключ    значення 
person = {'name' : "Oleh", 'age' : 16, }#тепер я можу використовувати ключі замість номерів в масиві
person1 = dict(name='Oleg', age=15) # те саме просто інакше

a = person['name'] #тепер a = "Oleh"
person.keys #виводить ключі з словника
person.items #виводить значення з словника
person.get('name') #виводить значення ключа name


#Функції

tasks = []

def add_task(task):
    tasks.append(task)